[
    {
        "title": "There is no music production without the artist",
        "title_it": "NON ESISTE LA PRODUZIONE MUSICALE SENZA L’ARTISTA",
        "date": "2023-04-28",
        "cover": "/images/Error.webp",
        "slug": "music-production-without-artist",
        "text": "<p>With over ten years of experience as a live performer, session musician, and artist in my own right, I've had the opportunity to play and record in different kinds of projects in varying genres and cultures.</p><br /><p>Over the years, I have seen the same pattern play out. It goes something like this:</p><br /><p>A band invests years of rehearsal time into a project. Finally, they decide to record it and take it to a local studio. The recording process, consisting in blood sweat and tears on the part of the band, is met with a smugly aloof 'sound engineer' that is counting a clock, and who personally, couldn't give a shit about the project itself, as long as the money comes in. The band spends thousands on recording/production costs, but when the mix comes back, they are not happy with it. They ask for revisions and the studio says that revisions are not included in the price. The band, disheartened, finishes the project without even liking it. The project is never shown to the world. It collects digital dust on some forgotten hard disk.</p><br /><p>I have been there unfortunately.</p><br /><p>And <i>there</i> is where my journey into the universe of music production began!</p><br /><p>After years of study, research and experimentation with my own creations and those of other artists, I have arrived at an 'artist-centric' approach to production. This means that for me to produce a song firstly entails getting into the head of the artist to understand what they want to communicate. Only after that can I implement the technical methods at mix-down that support and manifest that vision to the highest degree.</p><br /><p>In creating this service I hope to offer:<br /><ol><li>1. A point of reference for artists at different stages in their own personal journey of creation</li><li>2. The technical understanding necessary to help artists craft their own sound while simultaneously complying with industry standards and practices.</li><li>3. Passion of course! I love what I do! Enough of the cold, soulless 'cookie cutter' solutions so predominant in music production today.</li><li>4. Affordability and accessibility to all!</li></ol><br /><p>Sometimes we forget that the artist comes first - but without their vision there would be nothing to produce!</p>",
        "text_it": "<p>Con oltre dieci anni di esperienza come performer, musicista, cantante e artista a tutto tondo, ho avuto l'opportunità di suonare e registrare in diversi tipi di progetti, in vari generi e culture differenti.</p><br /><p>Nel corso degli anni, ho visto ripetersi lo stesso schema. Funziona sempre più o meno così:</p><br /><p>Una band investe anni in ideazione, creazione e prove per un progetto. Alla fine, si decide di registrarlo e portarlo in uno studio locale. Il processo di registrazione, consistente in sudore, sangue e lacrime da parte della band, è accolto da un \"tecnico del suono\" compiaciuto e distaccato che continua a guardare l’orologio e che personalmente non ha nessun interesse nel progetto tranne che i soldi che questo porterà. La band spende migliaia di euro per i costi di registrazione/produzione, ma quando arriva il mix nessuno è contento. Si chiedono revisioni e lo studio dice che le revisioni non sono incluse nel prezzo. La band, sfiduciata, termina il progetto senza nemmeno apprezzarlo. Siccome nessuno è contento, il progetto non viene mai pubblicato e mostrato al mondo. Raccoglie polvere digitale su qualche hard disk dimenticato.</p><br /><p>Ci sono passato anche io sfortunatamente.</p><br /><p>Ma è <i>lì</i> che è iniziato il mio viaggio nell'universo della produzione musicale!</p><br /><p>Dopo anni di studio, ricerca e sperimentazione con le mie creazioni e quelle di altri artisti, sono arrivato a un approccio alla produzione 'artista-centrico'. Questo significa che per me produrre una canzone comporta innanzitutto entrare nella mente dell'artista per capire cosa vuole comunicare. Solo dopo posso implementare i metodi tecnici che supportano e rendono manifesta quella visione al massimo livello.</p><br /><>Nel creare questo servizio spero di offrire:<br /><ol><li>1. Un punto di riferimento per gli artisti nelle diverse fasi del loro personale percorso di creazione</li><li>2. La comprensione tecnica necessaria per aiutare gli artisti a creare il proprio suono, rispettando contemporaneamente gli standard e le pratiche del settore.</li><li>3. La passione, ovviamente! Amo quello che faccio! Basta con le soluzioni fredde e senz'anima così predominanti nella produzione musicale di oggi.</li><li>4. Convenienza e accessibilità a tutti!</li></ol><br /><p>A volte dimentichiamo che l'artista viene prima di tutto e che senza la sua visione non verrebbe prodotto nulla!</p>"
    },
    {
        "title": "ANYONE CAN PRODUCE MUSIC IN 2023, RIGHT?",
        "title_it": "CHIUNQUE PUÒ PRODURRE MUSICA NEL 2023, GIUSTO?",
        "date": "2023-06-21",
        "cover": "/images/Articolo2.webp",
        "slug": "anyone-can-produce-music-2023-right",
        "text": "<p>In today's world of bedroom indie, Soundcloud rap, and TikTok hits- music making is for the masses, not the cultural elite who gate-keep the resources and technology.</p><br/><p>Modern technology has lowered the costs of everything. The last ten years or so have seen a massive shift in the landscape of music production- now more than ever, anyone can produce music.</p><br /><p>Personally, I create all my music with a nomadic studio that I can carry in my backpack. This allows me to be fluid and spontaneous, ready to collaborate with anyone, anywhere, anytime. Even if the acoustics of the room suck and there is unwanted background noise- if inspiration hits us in your kitchen I'd rather be able to record it then let the moment pass and risk missing it for good.</p><br /><p>I am by no means special in this. The list of famous artists who purposefully choose to record with minimal setups (despite having access to the best studios on earth) is growing by the year.</p><br /><p>Steve Lacy, a musician and member of the band 'The Internet' has created popular hits such as &quot;Dark Red&quot; and &quot;N Side&quot; utilizing only his iPhone and minimalistic equipment. In an interview with The FADER (<u><a href='https://www.thefader.com/2017/04/14/steve-lacy-kendrick-lamars-damn-pride'>link</a></u>) Lacy conveyed his fondness for the concept of not having to leave his house to produce music.</p><br /><p>Similarly, Billie Eilish and her brother, Finneas O'Connell, have produced chart-topping songs such as &quot;Bad Guy&quot; and &quot;Ocean Eyes&quot; within the confines of their childhood home in Los Angeles. Utilizing a laptop, microphone, and basic equipment, they were able to craft Grammy-winning music (<u><a href='https://www.youtube.com/watch?v=ZBJ914ha6LQ'>video</a></u>).</p><br /><p>These examples serve to underscore the fact that the equipment utilized in music production is no longer the sole determinant of quality.</p><br /><p>All that being said, creating music within a home or nomadic studio is not devoid of its own challenges. Besides the superficial issues such as acoustic environment and soundproofing proving problematic, there is also the deeper issue- not every artist is a producer. And not every producer is a mixing engineer. And not every mixing engineer is a mastering engineer etc. etc.</p><br /><p>The problem that comes with everyone being able to produce music, is that everyone also has to know how to do everything. In this fluid world, there are no separation of roles. The price of accessibility is responsibility.</p><br /><p>All our favorite artists from the past had a team, oftentimes dozens of people, each with different roles to play in the creative, recording, and production processes. This is still true of mainstream artists. But for the modern independent artist, each of these roles must be taken on by him/her self.</p><br /><p>In this interview (<u><a href='https://www.youtube.com/watch?v=RDyg_41QF1w'>video</a></u>) Ed Sheeran discusses the 10,000 rule or having to write 100 songs before he ever wrote one that he considered to be any good.</p><br /><p>They same logic applies to producing music. You have to do 100 mixes or more before you begin to understand what a good mix sounds like and the technical means to arrive there. Knowing how to manipulate the software to produce a desired result takes time. Training your ear and mind to know what your desired result sounds like may take even more time.</p><br /><p>Maybe a big, expensive, professional studio seems a bit archaic in today's world. But what will never go out of style is the skill of the artist, producer, engineer (or some combination of the three) to express a unique point of view. To do this will always require expertise in different disciplines.</p><br /><p>Some get that expertise from going to a music school and taking lessons. Others will get it from miserably failing over and over again until they finally start to learn (I belong to the second camp)- in either case, there are no free lunches. Just because the technology is there doesn't mean that it's easy- it only means that it is possible.</p><br /><p>If you are an artist- be an artist. Don't overwhelm yourself by trying to do everything. Unless it's what you want.</p>",
        "text_it": "<p>Nel mondo di oggi, con l'indie da camera, l'hip hop di Soundcloud e i successi su TikTok, la creazione musicale è alla portata di tutti, non dell'élite culturale che presidia le risorse e la tecnologia.</p><br/><p>La tecnologia moderna ha abbassato i costi di tutto. Negli ultimi dieci anni circa, si è verificato un enorme cambiamento nel panorama della produzione musicale: ora più che mai chiunque può produrre musica.</p><br /><p>Personalmente, creo tutta la mia musica con uno studio mobile che posso portare nello zaino. Questo mi permette di essere flessibile e spontaneo, pronto a collaborare con chiunque, ovunque, in qualsiasi momento. Anche se l'acustica della stanza è scarsa e ci sono rumori di fondo indesiderati, se l'ispirazione ci colpisce in cucina, preferisco poterla registrare anziché lasciar passare il momento e rischiare di perderlo per sempre.</p><br /><p>Non sono certo l'unico a farlo. La lista di artisti famosi che scelgono consapevolmente di registrare con apparecchiature minimali (nonostante abbiano accesso ai migliori studi del mondo) cresce di anno in anno.</p><br /><p>Steve Lacy, musicista e membro del gruppo &quot;The Internet&quot;, ha creato successi popolari come &quot; Dark Red&quot; e &quot;N Side&quot; utilizzando solo il suo iPhone e una strumentazione minimalista. In un'intervista con The FADER (<u><a href='https://www.thefader.com/2017/04/14/steve-lacy-kendrick-lamars-damn-pride'>link</a></u>)  Lacy ha espresso il suo apprezzamento per l'idea di non dover uscire di casa per produrre musica.</p><br /><p>Allo stesso modo, Billie Eilish e suo fratello Finneas O'Connell hanno prodotto brani in cima alle classifiche come &quot;Bad Guy&quot; e &quot;Ocean Eyes&quot; all'interno della loro casa d'infanzia a Los Angeles. Utilizzando un laptop, un microfono e attrezzature di base, sono riusciti a creare musica che ha vinto un Grammy (<u><a href='https://www.youtube.com/watch?v=ZBJ914ha6LQ'>video</a></u>).</p><br /><p>Questi esempi sottolineano il fatto che l'attrezzatura utilizzata nella produzione musicale non è più l'unico determinante della qualità.</p><br /><p>Detto ciò, creare musica in un ambiente domestico o in uno studio nomade comporta delle sfide. Oltre ai problemi superficiali come l'ambiente acustico e l'isolamento acustico, c'è anche una questione più profonda: non tutti gli artisti sono produttori, e non tutti i produttori sono tecnici di mixaggio, e così via.</p><br /><p>Il problema che deriva dal fatto che chiunque può produrre musica è che tutti devono anche saper fare tutto. In questo mondo fluido, non ci sono divisioni di ruoli. Il prezzo dell'accessibilità è la responsabilità.</p><br /><p>I nostri artisti preferiti del passato avevano una squadra, spesso composta da dozzine di persone, ognuna con ruoli diversi nei processi creativi, di registrazione e produzione. Questo vale ancora per gli artisti mainstream. Ma per l'artista indipendente moderno, ogni ruolo deve essere assunto da lei/lui stesso.</p><br /><p>In un’intervista (<u><a href='https://www.youtube.com/watch?v=RDyg_41QF1w'>video</a></u>) Ed Sheeran parla della &quot;regola delle 10.000 ore&quot; o della necessità di scrivere 100 canzoni prima di ritenere che ne sia una valida. Lo stesso vale per la produzione musicale. Devi fare 100 mix o più prima di iniziare a capire come suona un buon mix e i mezzi tecnici per ottenerlo. Impiegare il software per ottenere un risultato desiderato richiede tempo. Allenare l'orecchio e la mente per sapere come suona il risultato desiderato potrebbe richiedere ancora più tempo.</p><br /><p>Forse uno studio professionale grande e costoso sembra un po' arcaico nel mondo di oggi. Ma ciò che non passerà mai di moda è l'abilità dell'artista, del produttore, dell'ingegnere del suono (o di una combinazione dei tre) di esprimere un punto di vista unico. Per fare ciò, sarà sempre necessaria l'esperienza in diverse discipline.</p><br /><p>Alcuni acquisiscono questa esperienza frequentando una scuola di musica e prendendo lezioni. Altri la acquisteranno fallendo miseramente più e più volte finché non inizieranno finalmente a imparare (io faccio parte del secondo gruppo): in entrambi i casi, non ci sono pasti gratis. Solo perché la tecnologia è disponibile non significa che sia facile, significa solo che è possibile.</p><br /><p>Se sei un artista, sii un artista. Non affaticarti cercando di fare tutto da solo. A meno che questo non sia ciò che vuoi.</p>"
    }
]