[
    {
        "title": "There is no music production without the artist",
        "date": "2023-04-28",
        "cover": "https://images.unsplash.com/photo-1510915361894-db8b60106cb1?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxzZWFyY2h8MTR8fG11c2ljYXxlbnwwfHwwfHw%3D&auto=format&fit=crop&w=800&q=60",
        "slug": "music-production-without-artist",
        "text": "<p>With over ten years of experience as a live performer, session musician, and artist in my own right, I've had the opportunity to play and record in different kinds of projects in varying genres and cultures.</p><br /><p>Over the years, I have seen the same pattern play out. It goes something like this:</p><br /><p>A band invests years of rehearsal time into a project. Finally they decide to record it and take it to a local studio. The recording process, consisting in blood sweat and tears on the part of the band, is met with a smugly aloof 'sound engineer' that is counting a clock, and who personally, couldn't give a shit about the project itself, as long as the money comes in. The band spends thousands on recording/production costs, but when the mix comes back, they are not happy with it. They ask for revisions and the studio says that revisions are not included in the price. The band, disheartened, finishes the project without even liking it. The project is never shown to the world. It collects digital dust on some forgotten hard disk.</p><br /><p>I have been there unfortunately.</p><br /><p>And there is where my journey into the universe of music production began!</p><br /><p>After years of study, research and experimentation with my own creations and those of other artists, I have arrived at an 'artist-centric' approach to production. This means that for me to produce a song firstly entails getting into the head of the artist to understand what they want to communicate. Only after that can I implement the technical methods at mix-down that support and manifest that vision to the highest degree.</p><br /><p>In creating this service I hope to offer:<br /><ol><li>1. A point of reference for artists at different stages in their own personal journey of creation</li><li>2. The technical understanding necessary to help artists craft their own sound while simultaneously complying with industry standards and practices.</li><li>3. Passion of course! I love what I do! Enough of the cold, soulless 'cookie cutter' solutions so predominant in music production today.</li><li>4. Affordability and accessibility to all!</li></ol><br /><p>Sometimes we forget that the artist comes first- but without their vision there would be nothing to produce!</p>"
    }
]